Revit 2024 API
StairsRun.ExtensionBelowTreadBase Property
 Specifies a value to extend/trim the run's first step against base elevation of the stairs if the stairs begins with a tread.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public double ExtensionBelowTreadBase { get; set; }
Visual Basic
Public Property ExtensionBelowTreadBase As Double
	Get
	Set
Visual C++
public:
property double ExtensionBelowTreadBase {
	double get ();
	void set (double value);
}
Field Value
 0.0 if the stairs run connects with stairs landing or the stairs run doesn't begin with a thread.
Remarks
 This is useful in cases where the run attaches to the face of a floor opening rather than resting on the surface of the floor. Negative value extends the run's first step below the stairs' base elevation. Positive value trims it above the stairs' base elevation. This value should not be greater than run's top elevation.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The given value for extendBelowTreadBase must be no more than 30000 feet in absolute value. -or- When setting this property: The extendBelowTreadBase is not less than run height. -or- When setting this property: The extendBelowTreadBase is greater than the top elevation of the stairs run.
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: The run cannot extend its below base because its base joins with other stairs components. -or- When setting this property: The run cannot extend its below tread base because it doesn't begin with a tread.
See Also
StairsRun Class
Autodesk.Revit.DB.Architecture Namespace